-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/juangesino/Documents/UvA/Year 2/Semester 1/Period 2/Econometrics/CS/C
> E6/ce6.log
  log type:  text
 opened on:  21 Feb 2019, 06:36:39

. use MROZ

. gen lhw = log(hw)

. gen ax2 = ax*ax

. gen lww=log(ww) in 1/428
(325 missing values generated)

. reg lww we ax ax2 in 1/428

      Source |       SS           df       MS      Number of obs   =       428
-------------+----------------------------------   F(3, 424)       =     26.29
       Model |  35.0222962         3  11.6740987   Prob > F        =    0.0000
    Residual |  188.305145       424  .444115907   R-squared       =    0.1568
-------------+----------------------------------   Adj R-squared   =    0.1509
       Total |  223.327441       427  .523015084   Root MSE        =    .66642

------------------------------------------------------------------------------
         lww |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          we |   .1074896   .0141465     7.60   0.000     .0796837    .1352956
          ax |   .0415665   .0131752     3.15   0.002     .0156697    .0674633
         ax2 |  -.0008112   .0003932    -2.06   0.040    -.0015841   -.0000382
       _cons |  -.5220406   .1986321    -2.63   0.009    -.9124667   -.1316144
------------------------------------------------------------------------------

. replace lww = _b[_cons] + _b[we]*we + _b[ax]*ax + _b[ax2]*ax2 in 429/753
(325 real changes made)

. reg lfp lww lhw we un

      Source |       SS           df       MS      Number of obs   =       753
-------------+----------------------------------   F(4, 748)       =     10.77
       Model |  10.0560291         4  2.51400727   Prob > F        =    0.0000
    Residual |  174.671727       748  .233518351   R-squared       =    0.0544
-------------+----------------------------------   Adj R-squared   =    0.0494
       Total |  184.727756       752  .245648611   Root MSE        =    .48324

------------------------------------------------------------------------------
         lfp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lww |   .1082081   .0335541     3.22   0.001     .0423368    .1740794
         lhw |  -.0631694   .0317388    -1.99   0.047     -.125477   -.0008617
          we |   .0330291   .0088627     3.73   0.000     .0156304    .0504279
          un |  -.0049871   .0057425    -0.87   0.385    -.0162604    .0062862
       _cons |   .2045584   .1091363     1.87   0.061    -.0096915    .4188083
------------------------------------------------------------------------------

. logit lfp lww lhw we un

Iteration 0:   log likelihood =  -514.8732  
Iteration 1:   log likelihood = -493.68683  
Iteration 2:   log likelihood = -493.61576  
Iteration 3:   log likelihood = -493.61575  

Logistic regression                             Number of obs     =        753
                                                LR chi2(4)        =      42.51
                                                Prob > chi2       =     0.0000
Log likelihood = -493.61575                     Pseudo R2         =     0.0413

------------------------------------------------------------------------------
         lfp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lww |   .4747325   .1497862     3.17   0.002      .181157    .7683081
         lhw |  -.2733784    .139095    -1.97   0.049    -.5459997   -.0007572
          we |   .1448395   .0396545     3.65   0.000     .0671181     .222561
          un |  -.0219601   .0246917    -0.89   0.374     -.070355    .0264348
       _cons |   -1.30921   .4806705    -2.72   0.006    -2.251307   -.3671134
------------------------------------------------------------------------------

. probit lfp lww lhw we un

Iteration 0:   log likelihood =  -514.8732  
Iteration 1:   log likelihood = -493.54666  
Iteration 2:   log likelihood = -493.47989  
Iteration 3:   log likelihood = -493.47989  

Probit regression                               Number of obs     =        753
                                                LR chi2(4)        =      42.79
                                                Prob > chi2       =     0.0000
Log likelihood = -493.47989                     Pseudo R2         =     0.0416

------------------------------------------------------------------------------
         lfp |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lww |   .2951797   .0895144     3.30   0.001     .1197347    .4706247
         lhw |  -.1650711   .0841963    -1.96   0.050    -.3300929   -.0000494
          we |   .0891039   .0239691     3.72   0.000     .0421254    .1360824
          un |  -.0134041   .0152786    -0.88   0.380    -.0433495    .0165414
       _cons |  -.8115174   .2938417    -2.76   0.006    -1.387437   -.2355981
------------------------------------------------------------------------------

. dprobit lfp lww lhw we un

Iteration 0:   log likelihood =  -514.8732
Iteration 1:   log likelihood = -493.54666
Iteration 2:   log likelihood = -493.47989
Iteration 3:   log likelihood = -493.47989

Probit regression, reporting marginal effects           Number of obs =    753
                                                        LR chi2(4)    =  42.79
                                                        Prob > chi2   = 0.0000
Log likelihood = -493.47989                             Pseudo R2     = 0.0416

------------------------------------------------------------------------------
     lfp |      dF/dx   Std. Err.      z    P>|z|     x-bar  [    95% C.I.   ]
---------+--------------------------------------------------------------------
     lww |   .1157837   .0350652     3.30   0.001   1.09613   .047057   .18451
     lhw |  -.0647489   .0330243    -1.96   0.050   1.86155  -.129475 -.000022
      we |   .0349508   .0094028     3.72   0.000   12.2869   .016522   .05338
      un |  -.0052577   .0059931    -0.88   0.380   8.62351  -.017004  .006489
---------+--------------------------------------------------------------------
  obs. P |   .5683931
 pred. P |   .5729799  (at x-bar)
------------------------------------------------------------------------------
    z and P>|z| correspond to the test of the underlying coefficient being 0

. clear

. use usstate

. gen lyf = log(yf)

. gen lym = log(ym)

. reg wlfp lyf lym educ ue

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(4, 45)        =     29.42
       Model |  639.892412         4  159.973103   Prob > F        =    0.0000
    Residual |   244.66386        45  5.43697466   R-squared       =    0.7234
-------------+----------------------------------   Adj R-squared   =    0.6988
       Total |  884.556271        49  18.0521688   Root MSE        =    2.3317

------------------------------------------------------------------------------
        wlfp |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lyf |   26.16422   6.547954     4.00   0.000     12.97597    39.35248
         lym |  -18.75803   7.790726    -2.41   0.020    -34.44936   -3.066704
        educ |   .2867444   .0711579     4.03   0.000     .1434249    .4300638
          ue |  -1.102108   .2850005    -3.87   0.000    -1.676128   -.5280873
       _cons |   28.70748   10.01449     2.87   0.006     8.537258     48.8777
------------------------------------------------------------------------------

. gen lo = log(wlfp/(100-wlfp))

. reg lo lyf lym educ ue

      Source |       SS           df       MS      Number of obs   =        50
-------------+----------------------------------   F(4, 45)        =     28.97
       Model |  1.07244611         4  .268111527   Prob > F        =    0.0000
    Residual |  .416508344        45  .009255741   R-squared       =    0.7203
-------------+----------------------------------   Adj R-squared   =    0.6954
       Total |  1.48895445        49  .030386826   Root MSE        =    .09621

------------------------------------------------------------------------------
          lo |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         lyf |    1.08512   .2701672     4.02   0.000     .5409759    1.629265
         lym |  -.7804141   .3214437    -2.43   0.019    -1.427835   -.1329933
        educ |   .0118244    .002936     4.03   0.000     .0059111    .0177378
          ue |  -.0441297   .0117591    -3.75   0.000    -.0678137   -.0204458
       _cons |  -.8862941   .4131957    -2.14   0.037    -1.718513   -.0540752
------------------------------------------------------------------------------

. sum wlfp

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        wlfp |         50      57.474    4.248784       42.6       66.4

. disp (0.0118244)*(57.474/100)*(1-(57.474/100))*100
.28900481

