-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/juangesino/Documents/UvA/Year 2/Semester 1/Period 2/Econometrics/CS/C
> E2/ce2.log
  log type:  text
 opened on:  21 Feb 2019, 06:31:37

. set seed 7845

. set obs 1000
number of observations (_N) was 0, now 1,000

. generate x = 10 + 2* rnormal()

. generate u = rnormal()

. gen y = 10 + x + u

. reg y x

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =   3825.09
       Model |  3935.24473         1  3935.24473   Prob > F        =    0.0000
    Residual |  1026.74118       998  1.02879878   R-squared       =    0.7931
-------------+----------------------------------   Adj R-squared   =    0.7929
       Total |  4961.98592       999  4.96695287   Root MSE        =    1.0143

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .9950131   .0160882    61.85   0.000     .9634424    1.026584
       _cons |   10.04833   .1646217    61.04   0.000     9.725281    10.37137
------------------------------------------------------------------------------

. display (10-10.00786)
-.00786

. display (1-1.000595)
-.000595

. display ((1.000595-0.95)/0.146971)
.34425159

. display ((1.000595-1)/0.146971)
.00404842

. reg y x if (_n<=10)

      Source |       SS           df       MS      Number of obs   =        10
-------------+----------------------------------   F(1, 8)         =     28.17
       Model |   28.079944         1   28.079944   Prob > F        =    0.0007
    Residual |  7.97546104         8   .99693263   R-squared       =    0.7788
-------------+----------------------------------   Adj R-squared   =    0.7511
       Total |   36.055405         9  4.00615611   Root MSE        =    .99847

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   1.147336   .2161849     5.31   0.001     .6488124    1.645859
       _cons |   8.717985   2.226667     3.92   0.004     3.583281    13.85269
------------------------------------------------------------------------------

. display (10-9.395922)
.604078

. display (1-1.124036)
-.124036

. display ((1.124036-0.95)/0.0936091)
1.8591782

. gen u1 = 1 + 2*u

. gen y1 = 10 + x + u1

. reg y1 x

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =    946.71
       Model |  3895.89721         1  3895.89721   Prob > F        =    0.0000
    Residual |  4106.96473       998  4.11519512   R-squared       =    0.4868
-------------+----------------------------------   Adj R-squared   =    0.4863
       Total |  8002.86194       999  8.01087281   Root MSE        =    2.0286

------------------------------------------------------------------------------
          y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .9900261   .0321764    30.77   0.000     .9268849    1.053167
       _cons |   11.09665   .3292434    33.70   0.000     10.45056    11.74274
------------------------------------------------------------------------------

. gen u2 = 2*abs(u)

. gen u3=u*u

. gen y2 = 10 + x + u2

. gen y3 = 10 + x + u3

. reg y2 x

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =   2478.87
       Model |  3898.37266         1  3898.37266   Prob > F        =    0.0000
    Residual |  1569.49674       998  1.57264203   R-squared       =    0.7130
-------------+----------------------------------   Adj R-squared   =    0.7127
       Total |   5467.8694       999  5.47334274   Root MSE        =    1.2541

------------------------------------------------------------------------------
          y2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .9903406   .0198911    49.79   0.000     .9513075    1.029374
       _cons |    11.6899   .2035339    57.43   0.000      11.2905     12.0893
------------------------------------------------------------------------------

. reg y3 x

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =   1722.74
       Model |  3909.71117         1  3909.71117   Prob > F        =    0.0000
    Residual |  2264.92753       998  2.26946646   R-squared       =    0.6332
-------------+----------------------------------   Adj R-squared   =    0.6328
       Total |  6174.63869       999  6.18081951   Root MSE        =    1.5065

------------------------------------------------------------------------------
          y3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .9917798   .0238949    41.51   0.000     .9448898     1.03867
       _cons |   11.10934   .2445028    45.44   0.000     10.62955    11.58914
------------------------------------------------------------------------------

. cls

. clear all

. use capm

. sum rboeing rwalmart rsp500

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     rboeing |        156    .0004178    5.920053  -22.34813    17.3913
    rwalmart |        156    .1520385    3.021211  -14.69948   8.579766
      rsp500 |        156   -.0056995    3.677053  -18.19546    12.0258

. twoway (scatter rboeing rsp500)

. twoway (scatter rwalmart rsp500)

. correlate rboeing rwalmart rsp500
(obs=156)

             |  rboeing rwalmart   rsp500
-------------+---------------------------
     rboeing |   1.0000
    rwalmart |   0.4184   1.0000
      rsp500 |   0.7490   0.5907   1.0000


. gen rp = rsp500 - 0.04
(1 missing value generated)

. gen diffwalmart = rwalmart - 0.04
(1 missing value generated)

. gen diffboeing = rboeing - 0.04
(1 missing value generated)

. reg diffboeing rp

      Source |       SS           df       MS      Number of obs   =       156
-------------+----------------------------------   F(1, 154)       =    196.79
       Model |  3047.43498         1  3047.43498   Prob > F        =    0.0000
    Residual |  2384.85506       154  15.4860718   R-squared       =    0.5610
-------------+----------------------------------   Adj R-squared   =    0.5581
       Total |  5432.29004       155  35.0470325   Root MSE        =    3.9352

------------------------------------------------------------------------------
  diffboeing |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          rp |   1.205873   .0859617    14.03   0.000     1.036057    1.375689
       _cons |   .0155256   .3150954     0.05   0.961    -.6069417    .6379928
------------------------------------------------------------------------------

. reg diffwalmart rp

      Source |       SS           df       MS      Number of obs   =       156
-------------+----------------------------------   F(1, 154)       =     82.54
       Model |  493.693684         1  493.693684   Prob > F        =    0.0000
    Residual |  921.102151       154   5.9811828   R-squared       =    0.3490
-------------+----------------------------------   Adj R-squared   =    0.3447
       Total |  1414.79584       155  9.12771507   Root MSE        =    2.4456

------------------------------------------------------------------------------
 diffwalmart |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          rp |    .485359   .0534229     9.09   0.000     .3798226    .5908954
       _cons |   .1342191   .1958236     0.69   0.494     -.252628    .5210663
------------------------------------------------------------------------------

. display (1.205873-1)/0.0859617
2.3949387

. display (0.0155256-0)/0.3150954
.0492727

. display (0.485359-1)/0.0534229
-9.6333408

. display (0.1342191-0)/0.1958236
.68540819

. reg diffboeing rp, noconstant

      Source |       SS           df       MS      Number of obs   =       156
-------------+----------------------------------   F(1, 155)       =    198.07
       Model |  3047.64179         1  3047.64179   Prob > F        =    0.0000
    Residual |  2384.89266       155  15.3864042   R-squared       =    0.5610
-------------+----------------------------------   Adj R-squared   =    0.5582
       Total |  5432.53445       156  34.8239388   Root MSE        =    3.9226

------------------------------------------------------------------------------
  diffboeing |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          rp |    1.20582    .085678    14.07   0.000     1.036573    1.375067
------------------------------------------------------------------------------

. reg diffwalmart rp, noconstant

      Source |       SS           df       MS      Number of obs   =       156
-------------+----------------------------------   F(1, 155)       =     82.68
       Model |  492.842024         1  492.842024   Prob > F        =    0.0000
    Residual |   923.91202       155  5.96072271   R-squared       =    0.3479
-------------+----------------------------------   Adj R-squared   =    0.3437
       Total |  1416.75404       156  9.08175669   Root MSE        =    2.4415

------------------------------------------------------------------------------
 diffwalmart |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          rp |   .4849025   .0533274     9.09   0.000     .3795603    .5902447
------------------------------------------------------------------------------

