-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/juangesino/Documents/UvA/Year 2/Semester 1/Period 2/Econometrics/CS/C
> E1/ce1.log
  log type:  text
 opened on:  21 Feb 2019, 06:28:49

. use caschool

. list testscr str

     +--------------------+
     | testscr        str |
     |--------------------|
  1. |   690.8   17.88991 |
  2. |   661.2   21.52466 |
  3. |   643.6   18.69723 |
  4. |   647.7   17.35714 |
  5. |  640.85   18.67133 |
     |--------------------|
  6. |  605.55   21.40625 |
  7. |  606.75       19.5 |
  8. |     609   20.89412 |
  9. |   612.5   19.94737 |
 10. |  612.65   20.80556 |
     |--------------------|
 11. |  615.75   21.23809 |
 12. |   616.3         21 |
 13. |   616.3       20.6 |
 14. |   616.3   20.00822 |
 15. |  616.45   18.02778 |
     |--------------------|
 16. |  617.35   20.25196 |
 17. |  618.05   16.97787 |
 18. |   618.3    16.5098 |
 19. |   619.8   22.70402 |
 20. |   620.3   19.91111 |
     |--------------------|
 21. |   620.5   18.33333 |
 22. |   621.4   22.61905 |
 23. |  621.75   19.44828 |
 24. |  622.05   25.05263 |
 25. |   622.6   20.67544 |
     |--------------------|
 26. |   623.1   18.68235 |
 27. |   623.2   22.84553 |
 28. |  623.45   19.26667 |
 29. |   623.6      19.25 |
 30. |  624.15   20.54545 |
     |--------------------|
 31. |  624.55   20.60697 |
 32. |  624.95   21.07268 |
 33. |   625.3   21.53581 |
 34. |  625.85     19.904 |
 35. |   626.1   21.19407 |
     |--------------------|
 36. |   626.8   21.86535 |
 37. |   626.9   18.32965 |
 38. |   627.1   16.22857 |
 39. |  627.25   19.17857 |
 40. |   627.3   20.27737 |
     |--------------------|
 41. |  628.25   22.98614 |
 42. |   628.4   20.44444 |
 43. |  628.55   19.82085 |
 44. |  628.65   23.20522 |
 45. |  628.75   19.26697 |
     |--------------------|
 46. |   629.8   23.30189 |
 47. |  630.35   21.18829 |
 48. |   630.4    20.8718 |
 49. |  630.55   19.01749 |
 50. |  630.55   21.91938 |
     |--------------------|
 51. |  631.05   20.10124 |
 52. |   631.4   21.47651 |
 53. |  631.85   20.06579 |
 54. |   631.9    20.3751 |
 55. |  631.95   22.44648 |
     |--------------------|
 56. |     632   22.89524 |
 57. |   632.2   20.49797 |
 58. |  632.25         20 |
 59. |  632.45   22.25658 |
 60. |  632.85   21.56436 |
     |--------------------|
 61. |  632.95   19.47737 |
 62. |  633.05   17.67002 |
 63. |  633.15   21.94756 |
 64. |  633.65   21.78339 |
 65. |   633.9      19.14 |
     |--------------------|
 66. |     634    18.1105 |
 67. |  634.05   20.68242 |
 68. |   634.1   22.62361 |
 69. |   634.1    21.7865 |
 70. |  634.15   18.58293 |
     |--------------------|
 71. |   634.2   21.54545 |
 72. |   634.4   21.15289 |
 73. |  634.55   16.63333 |
 74. |   634.7   21.14438 |
 75. |   634.9   19.78182 |
     |--------------------|
 76. |  634.95   18.98373 |
 77. |  635.05   17.66767 |
 78. |   635.2   17.75499 |
 79. |  635.45   15.27273 |
 80. |   635.6         14 |
     |--------------------|
 81. |   635.6   20.59613 |
 82. |  635.75   16.31169 |
 83. |  635.95   21.12796 |
 84. |   636.1   17.48801 |
 85. |   636.5   17.88679 |
     |--------------------|
 86. |   636.6   19.30676 |
 87. |   636.7   20.89231 |
 88. |   636.9   21.28684 |
 89. |  636.95    20.1956 |
 90. |     637      24.95 |
     |--------------------|
 91. |   637.1   18.13043 |
 92. |  637.35         20 |
 93. |  637.65   18.72951 |
 94. |  637.95      18.25 |
 95. |  637.95   18.99257 |
     |--------------------|
 96. |     638   19.88764 |
 97. |   638.2   19.37895 |
 98. |   638.3   20.46259 |
 99. |   638.3   22.29157 |
100. |  638.35   20.70474 |
     |--------------------|
101. |  638.55   19.06005 |
102. |   638.7   20.23247 |
103. |  639.25   19.69012 |
104. |   639.3   20.36254 |
105. |  639.35   19.75422 |
     |--------------------|
106. |   639.5   19.37977 |
107. |  639.75   22.92351 |
108. |   639.8    19.3734 |
109. |  639.85   19.15516 |
110. |   639.9       21.3 |
     |--------------------|
111. |   640.1   18.30357 |
112. |  640.15   21.07926 |
113. |   640.5   18.79121 |
114. |  640.75   19.62662 |
115. |   640.9   19.59016 |
     |--------------------|
116. |   641.1   20.87187 |
117. |  641.45     21.115 |
118. |  641.45   20.08452 |
119. |  641.55   19.91049 |
120. |   641.8   17.81285 |
     |--------------------|
121. |   642.2   18.13333 |
122. |   642.2   19.22221 |
123. |   642.4   18.66072 |
124. |  642.75       19.6 |
125. |  643.05   19.28384 |
     |--------------------|
126. |   643.2   22.81818 |
127. |  643.25   18.80922 |
128. |   643.4   21.37363 |
129. |   643.4   20.02041 |
130. |   643.5   21.49862 |
     |--------------------|
131. |   643.5   15.42857 |
132. |   643.7       22.4 |
133. |   643.7   20.12709 |
134. |   644.2   19.03798 |
135. |   644.2   17.34216 |
     |--------------------|
136. |   644.4   17.01863 |
137. |  644.45       20.8 |
138. |  644.45   21.15385 |
139. |   644.5   18.45833 |
140. |  644.55   19.14082 |
     |--------------------|
141. |   644.7   19.40766 |
142. |  644.95   19.56896 |
143. |   645.1    21.5012 |
144. |  645.25   17.52941 |
145. |  645.55   16.43017 |
     |--------------------|
146. |  645.55   19.79654 |
147. |   645.6   17.18613 |
148. |  645.75   17.61589 |
149. |  645.75   20.12537 |
150. |     646   22.16667 |
     |--------------------|
151. |   646.2   19.96154 |
152. |  646.35   19.03945 |
153. |   646.4   15.22436 |
154. |   646.5   21.14475 |
155. |  646.55    19.6439 |
     |--------------------|
156. |   646.7   21.04869 |
157. |   646.9   20.17544 |
158. |  646.95    21.3913 |
159. |  647.05   20.00833 |
160. |  647.25   20.29137 |
     |--------------------|
161. |   647.3   17.66667 |
162. |   647.6   18.22055 |
163. |   647.6     20.271 |
164. |     648   20.19895 |
165. |   648.2   21.38424 |
     |--------------------|
166. |  648.25   20.97368 |
167. |  648.35         20 |
168. |   648.7   17.15328 |
169. |  648.95   22.34977 |
170. |  649.15   22.17007 |
     |--------------------|
171. |   649.3   18.18182 |
172. |   649.5   18.95714 |
173. |   649.7   19.74533 |
174. |  649.85   16.42623 |
175. |  650.45    16.6254 |
     |--------------------|
176. |  650.55   16.38177 |
177. |   650.6   20.07416 |
178. |  650.65   17.99544 |
179. |   650.9    19.3913 |
180. |   650.9   16.42857 |
     |--------------------|
181. |  651.15   16.72949 |
182. |   651.2   24.41345 |
183. |  651.35   18.26415 |
184. |   651.4   18.95504 |
185. |  651.45   21.03896 |
     |--------------------|
186. |   651.8   20.74074 |
187. |  651.85       18.1 |
188. |   651.9   19.84615 |
189. |     652       21.6 |
190. |   652.1   22.44242 |
     |--------------------|
191. |   652.1   23.01438 |
192. |   652.3   17.74892 |
193. |   652.3   18.28664 |
194. |  652.35   19.26544 |
195. |   652.4   22.66667 |
     |--------------------|
196. |   652.4   19.29412 |
197. |   652.5   17.36364 |
198. |  652.85   19.82143 |
199. |   653.1   20.43378 |
200. |   653.4   21.03721 |
     |--------------------|
201. |   653.5   19.92462 |
202. |  653.55   19.00986 |
203. |  653.55   23.82222 |
204. |   653.7   19.36909 |
205. |   653.8   19.82857 |
     |--------------------|
206. |  653.85   15.25885 |
207. |  653.95   17.16129 |
208. |   654.1   21.81333 |
209. |   654.2   19.07471 |
210. |   654.2   25.78512 |
     |--------------------|
211. |   654.3   18.21261 |
212. |   654.6   18.16606 |
213. |  654.85   16.97297 |
214. |  654.85   21.50087 |
215. |   654.9       20.6 |
     |--------------------|
216. |  655.05   16.99029 |
217. |  655.05   20.77954 |
218. |  655.05   15.51247 |
219. |   655.2   19.88506 |
220. |   655.3   21.39882 |
     |--------------------|
221. |  655.35   20.49751 |
222. |  655.35   19.36376 |
223. |   655.4   17.65957 |
224. |  655.55   21.01796 |
225. |   655.7   19.05565 |
     |--------------------|
226. |   655.8   22.53846 |
227. |  655.85   21.10787 |
228. |   656.4   20.05135 |
229. |   656.5   14.20176 |
230. |  656.55   18.47687 |
     |--------------------|
231. |  656.65   18.63542 |
232. |   656.7   20.94595 |
233. |   656.8   21.08548 |
234. |   656.8   18.69288 |
235. |     657   20.86808 |
     |--------------------|
236. |     657   19.82558 |
237. |  657.15      19.75 |
238. |   657.4       19.5 |
239. |   657.5    18.3908 |
240. |  657.55   18.78676 |
     |--------------------|
241. |  657.65   19.77018 |
242. |  657.75   19.33333 |
243. |   657.8   21.46392 |
244. |   657.9   23.08492 |
245. |     658   21.06299 |
     |--------------------|
246. |  658.35   18.68687 |
247. |   658.6   20.77024 |
248. |   658.8   19.30556 |
249. |  659.05    20.1328 |
250. |  659.15   20.66964 |
     |--------------------|
251. |  659.35   22.28155 |
252. |   659.4   20.60027 |
253. |   659.4   20.82734 |
254. |   659.8   19.22492 |
255. |   659.9   17.65477 |
     |--------------------|
256. |  660.05         17 |
257. |   660.1   16.49773 |
258. |   660.2   19.78261 |
259. |   660.3   22.30216 |
260. |  660.75   17.73077 |
     |--------------------|
261. |  660.95   20.44836 |
262. |  661.35   20.37169 |
263. |  661.45   20.16479 |
264. |   661.6   21.61538 |
265. |   661.6   20.56143 |
     |--------------------|
266. |  661.85   19.95551 |
267. |  661.85   21.18387 |
268. |  661.85   18.81042 |
269. |   661.9   20.57838 |
270. |   661.9   18.32461 |
     |--------------------|
271. |  661.95   18.82063 |
272. |   662.4   20.81633 |
273. |   662.4         20 |
274. |  662.45   19.68182 |
275. |   662.5   19.39018 |
     |--------------------|
276. |  662.55   20.92732 |
277. |  662.55   19.94437 |
278. |  662.65   20.79109 |
279. |   662.7   19.20354 |
280. |  662.75   19.02439 |
     |--------------------|
281. |   662.9   17.62058 |
282. |  663.35   20.23715 |
283. |  663.45   19.29374 |
284. |   663.5   18.82998 |
285. |  663.85   20.33949 |
     |--------------------|
286. |  663.85     19.229 |
287. |   663.9    17.8913 |
288. |     664   19.51881 |
289. |     664   19.08451 |
290. |  664.15   19.93548 |
     |--------------------|
291. |  664.15   18.87326 |
292. |   664.3   20.14178 |
293. |   664.4   23.55637 |
294. |  664.45   21.46479 |
295. |   664.7   19.19101 |
     |--------------------|
296. |  664.75    20.1308 |
297. |  664.95       25.8 |
298. |  664.95   18.77774 |
299. |   665.1   19.10982 |
300. |   665.2   19.70109 |
     |--------------------|
301. |  665.35   18.61594 |
302. |  665.65   20.99721 |
303. |   665.9         20 |
304. |  665.95   20.98325 |
305. |     666   21.64262 |
     |--------------------|
306. |  666.05   20.02967 |
307. |   666.1    19.8114 |
308. |  666.15         18 |
309. |  666.15   19.35811 |
310. |  666.45   20.17912 |
     |--------------------|
311. |  666.55   21.11986 |
312. |   666.6   23.38974 |
313. |  666.65   22.18182 |
314. |  666.65   19.94283 |
315. |   666.7   17.78826 |
     |--------------------|
316. |  666.85   14.70588 |
317. |  666.85   19.04077 |
318. |  667.15   20.89195 |
319. |   667.2   19.83851 |
320. |  667.45   19.52191 |
     |--------------------|
321. |  667.45   20.68622 |
322. |   667.6   18.18182 |
323. |     668   18.89224 |
324. |   668.1   24.88889 |
325. |   668.4   18.58064 |
     |--------------------|
326. |   668.6      18.04 |
327. |  668.65   17.73399 |
328. |   668.8   21.45455 |
329. |   668.9   19.92343 |
330. |  668.95   20.33942 |
     |--------------------|
331. |   669.1   22.54608 |
332. |   669.3   21.10344 |
333. |   669.3   18.19743 |
334. |  669.35   20.10768 |
335. |  669.35   19.15984 |
     |--------------------|
336. |   669.8   19.54545 |
337. |  669.85   20.88889 |
338. |  669.95    18.3915 |
339. |     670    19.1799 |
340. |   670.7   19.39771 |
     |--------------------|
341. |  671.25   21.67827 |
342. |   671.3   19.28889 |
343. |   671.6   20.34927 |
344. |   671.6   20.96416 |
345. |  671.65   19.46039 |
     |--------------------|
346. |   671.7   19.28572 |
347. |  671.75   20.91979 |
348. |   671.9   20.90021 |
349. |   671.9   20.59575 |
350. |  671.95     19.375 |
     |--------------------|
351. |  672.05   19.95122 |
352. |  672.05   18.84973 |
353. |   672.3   18.11787 |
354. |  672.35   19.18341 |
355. |  672.45         22 |
     |--------------------|
356. |  672.55   21.58416 |
357. |   672.7   20.38889 |
358. |  673.05    16.2931 |
359. |  673.25   18.27778 |
360. |   673.3   19.37472 |
     |--------------------|
361. |  673.55   18.90909 |
362. |  673.55   16.40693 |
363. |   673.9    15.5914 |
364. |  674.25   18.70694 |
365. |   675.4   18.32985 |
     |--------------------|
366. |   675.7   17.90235 |
367. |  676.15   18.91157 |
368. |  676.55   20.32497 |
369. |   676.6   20.02457 |
370. |  676.85         24 |
     |--------------------|
371. |  676.95   17.60784 |
372. |  677.25   19.34853 |
373. |  677.95   19.67846 |
374. |  678.05   18.72861 |
375. |   678.4   15.88235 |
     |--------------------|
376. |   678.8   20.05491 |
377. |   679.4   17.98825 |
378. |   679.5   16.96629 |
379. |  679.65   19.23937 |
380. |  679.75   19.19586 |
     |--------------------|
381. |   679.8   19.59906 |
382. |  680.05   20.54348 |
383. |  680.45   18.58848 |
384. |   681.3   15.60419 |
385. |   681.3   15.29304 |
     |--------------------|
386. |   681.6   17.65537 |
387. |   681.9   17.57976 |
388. |  682.15   22.33333 |
389. |  682.45      18.75 |
390. |  682.55   18.10241 |
     |--------------------|
391. |  682.65   20.25641 |
392. |  683.35   18.80207 |
393. |   683.4    18.7723 |
394. |   684.3   20.40521 |
395. |  684.35   18.65079 |
     |--------------------|
396. |   684.8   20.70707 |
397. |  684.95         22 |
398. |  686.05   17.69978 |
399. |   686.7   21.48329 |
400. |  687.55   16.70103 |
     |--------------------|
401. |   689.1   19.57567 |
402. |  691.05   17.25806 |
403. |  691.35   17.37526 |
404. |   691.9   17.34931 |
405. |  693.95   16.26229 |
     |--------------------|
406. |  694.25   17.70045 |
407. |   694.8   20.12881 |
408. |   695.2   18.26539 |
409. |   695.3   14.54214 |
410. |  696.55   19.15261 |
     |--------------------|
411. |   698.2   17.36574 |
412. |  698.25   15.13898 |
413. |  698.45   17.84266 |
414. |   699.1   15.40704 |
415. |   700.3   18.86534 |
     |--------------------|
416. |   704.3   16.47413 |
417. |  706.75   17.86263 |
418. |     645   21.88586 |
419. |   672.2       20.2 |
420. |  655.75    19.0364 |
     +--------------------+

. sum testscr str

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     testscr |        420    654.1565    19.05335     605.55     706.75
         str |        420    19.64043    1.891812         14       25.8

. sum testscr str, d

                           testscr
-------------------------------------------------------------
      Percentiles      Smallest
 1%       612.65         605.55
 5%       623.15         606.75
10%      630.375            609       Obs                 420
25%          640          612.5       Sum of Wgt.         420

50%       654.45                      Mean           654.1565
                        Largest       Std. Dev.      19.05335
75%      666.675          699.1
90%        679.1          700.3       Variance       363.0301
95%        685.5          704.3       Skewness       .0916151
99%       698.45         706.75       Kurtosis       2.745712

                             str
-------------------------------------------------------------
      Percentiles      Smallest
 1%     15.13898             14
 5%     16.41658       14.20176
10%     17.34573       14.54214       Obs                 420
25%     18.58179       14.70588       Sum of Wgt.         420

50%     19.72321                      Mean           19.64043
                        Largest       Std. Dev.      1.891812
75%     20.87183          24.95
90%     21.87561       25.05263       Variance       3.578952
95%     22.64514       25.78512       Skewness      -.0253655
99%     24.88889           25.8       Kurtosis       3.609597

. correlate testscr str
(obs=420)

             |  testscr      str
-------------+------------------
     testscr |   1.0000
         str |  -0.2264   1.0000


. twoway (scatter testscr str)

. regress testscr str testscr str
note: str omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =       420
-------------+----------------------------------   F(2, 417)       =         .
       Model |  152109.594         2  76054.7968   Prob > F        =         .
    Residual |           0       417           0   R-squared       =    1.0000
-------------+----------------------------------   Adj R-squared   =    1.0000
       Total |  152109.594       419  363.030056   Root MSE        =         0

------------------------------------------------------------------------------
     testscr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         str |          0  (omitted)
     testscr |          1          .        .       .            .           .
         str |          0  (omitted)
       _cons |          0  (omitted)
------------------------------------------------------------------------------

. regress testscr str testscr str, vce(robust)
note: str omitted because of collinearity

Linear regression                               Number of obs     =        420
                                                F(0, 417)         =          .
                                                Prob > F          =          .
                                                R-squared         =     1.0000
                                                Root MSE          =          0

------------------------------------------------------------------------------
             |               Robust
     testscr |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         str |          0  (omitted)
     testscr |          1          .        .       .            .           .
         str |          0  (omitted)
       _cons |          0  (omitted)
------------------------------------------------------------------------------

. clear

. set seed 7845

. set obs 1000
number of observations (_N) was 0, now 1,000

. generate x = 10 + 2* rnormal()

. generate u = rnormal()

. gen y = 10 + x + u

. sum x y

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           x |      1,000    10.03633    1.994685    4.37789   15.68568
           y |      1,000    20.03461    2.228666   12.64961   27.22395

. twoway (scatter y x)

. regress y x

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =   3825.09
       Model |  3935.24473         1  3935.24473   Prob > F        =    0.0000
    Residual |  1026.74118       998  1.02879878   R-squared       =    0.7931
-------------+----------------------------------   Adj R-squared   =    0.7929
       Total |  4961.98592       999  4.96695287   Root MSE        =    1.0143

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .9950131   .0160882    61.85   0.000     .9634424    1.026584
       _cons |   10.04833   .1646217    61.04   0.000     9.725281    10.37137
------------------------------------------------------------------------------

. twoway (lfit y x) (scatter y x)

. gen xx=10+2*rnormal()

. gen uu=rnormal()

. gen yy=10+xx+uu

. regress yy xx

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =   3911.95
       Model |  4053.06578         1  4053.06578   Prob > F        =    0.0000
    Residual |  1034.00208       998  1.03607423   R-squared       =    0.7967
-------------+----------------------------------   Adj R-squared   =    0.7965
       Total |  5087.06786       999  5.09216002   Root MSE        =    1.0179

------------------------------------------------------------------------------
          yy |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          xx |   1.010568   .0161573    62.55   0.000     .9788621    1.042275
       _cons |   9.903976   .1651751    59.96   0.000     9.579846    10.22811
------------------------------------------------------------------------------

. gen w=2*x

. reg y w

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =   3825.09
       Model |  3935.24473         1  3935.24473   Prob > F        =    0.0000
    Residual |  1026.74118       998  1.02879878   R-squared       =    0.7931
-------------+----------------------------------   Adj R-squared   =    0.7929
       Total |  4961.98592       999  4.96695287   Root MSE        =    1.0143

------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           w |   .4975065   .0080441    61.85   0.000     .4817212    .5132918
       _cons |   10.04833   .1646217    61.04   0.000     9.725281    10.37137
------------------------------------------------------------------------------

. predict resid, residuals

. correlate y x w resid, covariance
(obs=1,000)

             |        y        x        w    resid
-------------+------------------------------------
           y |  4.96695
           x |  3.95893  3.97877
           w |  7.91785  7.95754  15.9151
       resid |  1.02777 -3.4e-15 -6.9e-15  1.02777


. correlate y x w resid
(obs=1,000)

             |        y        x        w    resid
-------------+------------------------------------
           y |   1.0000
           x |   0.8905   1.0000
           w |   0.8905   1.0000   1.0000
       resid |   0.4549  -0.0000  -0.0000   1.0000


