-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/juangesino/Documents/UvA/Year 2/Semester 1/Period 2/Econometrics/CS/C
> E5/ce5.log
  log type:  text
 opened on:  21 Feb 2019, 06:35:47

. set obs 100
number of observations (_N) was 0, now 100

. gen U = rnormal()

. gen IS = rnormal()

. gen CS = 10+IS+2*U

. gen YS = 10+2*IS+2*U

. reg CS YS

      Source |       SS           df       MS      Number of obs   =       100
-------------+----------------------------------   F(1, 98)        =   1017.72
       Model |  445.533511         1  445.533511   Prob > F        =    0.0000
    Residual |  42.9021069        98  .437776601   R-squared       =    0.9122
-------------+----------------------------------   Adj R-squared   =    0.9113
       Total |  488.435618        99  4.93369312   Root MSE        =    .66165

------------------------------------------------------------------------------
          CS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          YS |   .7482467   .0234548    31.90   0.000     .7017015    .7947919
       _cons |   2.410884   .2402551    10.03   0.000     1.934106    2.887662
------------------------------------------------------------------------------

. display (0.5)-(0.7482)
-.2482

. disp (0.7482467-0.5)/(0.0234548)
10.584047

. clear

. set obs 1000
number of observations (_N) was 0, now 1,000

. gen U = rnormal()

. gen IS = rnormal()

. gen CS = 10+IS+2*U

. gen YS = 10+2*IS+2*U

. reg CS YS

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =   9011.76
       Model |  4404.92497         1  4404.92497   Prob > F        =    0.0000
    Residual |  487.819836       998  .488797431   R-squared       =    0.9003
-------------+----------------------------------   Adj R-squared   =    0.9002
       Total |   4892.7448       999  4.89764244   Root MSE        =    .69914

------------------------------------------------------------------------------
          CS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          YS |    .770971   .0081214    94.93   0.000     .7550339    .7869081
       _cons |   2.275579   .0839816    27.10   0.000     2.110778     2.44038
------------------------------------------------------------------------------

. ivreg CS (YS=IS)

Instrumental variables (2SLS) regression

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =    697.22
       Model |  3792.75014         1  3792.75014   Prob > F        =    0.0000
    Residual |  1099.99466       998  1.10219906   R-squared       =    0.7752
-------------+----------------------------------   Adj R-squared   =    0.7750
       Total |   4892.7448       999  4.89764244   Root MSE        =    1.0499

------------------------------------------------------------------------------
          CS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          YS |   .4835579   .0183132    26.40   0.000     .4476211    .5194947
       _cons |   5.142801   .1856839    27.70   0.000     4.778426    5.507177
------------------------------------------------------------------------------
Instrumented:  YS
Instruments:   IS
------------------------------------------------------------------------------

. display (0.5)-(0.4835579)
.0164421

. disp (0.4835579-0.5)/(0.0183132)
-.8978278

. regress YS IS

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =    795.27
       Model |  3286.48249         1  3286.48249   Prob > F        =    0.0000
    Residual |  4124.27232       998  4.13253739   R-squared       =    0.4435
-------------+----------------------------------   Adj R-squared   =    0.4429
       Total |   7410.7548       999  7.41817298   Root MSE        =    2.0329

------------------------------------------------------------------------------
          YS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          IS |   1.936326   .0686627    28.20   0.000     1.801586    2.071065
       _cons |   9.958138   .0642879   154.90   0.000     9.831983    10.08429
------------------------------------------------------------------------------

. predict YSFIT
(option xb assumed; fitted values)

. regress CS YSFIT

      Source |       SS           df       MS      Number of obs   =     1,000
-------------+----------------------------------   F(1, 998)       =    185.96
       Model |  768.472485         1  768.472485   Prob > F        =    0.0000
    Residual |  4124.27232       998  4.13253739   R-squared       =    0.1571
-------------+----------------------------------   Adj R-squared   =    0.1562
       Total |   4892.7448       999  4.89764244   Root MSE        =    2.0329

------------------------------------------------------------------------------
          CS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       YSFIT |   .4835579   .0354603    13.64   0.000     .4139726    .5531433
       _cons |   5.142801   .3595445    14.30   0.000     4.437251    5.848351
------------------------------------------------------------------------------

. clear

. use Brabant

. gen lexp2 = lexp*lexp

. reg lwage educ lexp lexp2

      Source |       SS           df       MS      Number of obs   =       839
-------------+----------------------------------   F(3, 835)       =     41.78
       Model |  29.8539222         3  9.95130739   Prob > F        =    0.0000
    Residual |  198.880799       835  .238180598   R-squared       =    0.1305
-------------+----------------------------------   Adj R-squared   =    0.1274
       Total |  228.734721       838  .272953128   Root MSE        =    .48804

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0485973   .0054433     8.93   0.000     .0379132    .0592815
        lexp |   .0737821   .0314978     2.34   0.019     .0119579    .1356064
       lexp2 |  -.0014757   .0006863    -2.15   0.032    -.0028227   -.0001287
       _cons |   1.575157   .3627681     4.34   0.000     .8631129    2.287202
------------------------------------------------------------------------------

. ivreg lwage (educ = faed mark ssoc fhigh fint fself) lexp lexp2

Instrumental variables (2SLS) regression

      Source |       SS           df       MS      Number of obs   =       839
-------------+----------------------------------   F(3, 835)       =     30.91
       Model |  14.4993938         3  4.83313128   Prob > F        =    0.0000
    Residual |  214.235328       835  .256569255   R-squared       =    0.0634
-------------+----------------------------------   Adj R-squared   =    0.0600
       Total |  228.734721       838  .272953128   Root MSE        =    .50653

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0923021   .0130052     7.10   0.000     .0667754    .1178288
        lexp |   .0660809   .0327562     2.02   0.044     .0017867    .1303751
       lexp2 |  -.0007302   .0007398    -0.99   0.324    -.0021823    .0007218
       _cons |   1.082091   .3990309     2.71   0.007     .2988692    1.865312
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   lexp lexp2 faed mark ssoc fhigh fint fself
------------------------------------------------------------------------------

. regress educ lexp lexp2 faed mark ssoc fhigh fint fself

      Source |       SS           df       MS      Number of obs   =       839
-------------+----------------------------------   F(8, 830)       =    112.95
       Model |  7100.09905         8  887.512381   Prob > F        =    0.0000
    Residual |  6521.61966       830  7.85737309   R-squared       =    0.5212
-------------+----------------------------------   Adj R-squared   =    0.5166
       Total |  13621.7187       838  16.2550343   Root MSE        =    2.8031

------------------------------------------------------------------------------
        educ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        lexp |   .1935286   .1870579     1.03   0.301    -.1736337    .5606908
       lexp2 |  -.0145541   .0040586    -3.59   0.000    -.0225203   -.0065878
        faed |   .6758779   .1559075     4.34   0.000     .3698586    .9818972
        mark |   .7235177   .0741324     9.76   0.000     .5780086    .8690267
        ssoc |  -1.272651   .3414709    -3.73   0.000    -1.942899   -.6024025
       fhigh |   1.431699   .5862694     2.44   0.015     .2809543    2.582444
        fint |   .0384154   .3827488     0.10   0.920    -.7128541    .7896849
       fself |  -.3707694   .2287508    -1.62   0.105    -.8197674    .0782287
       _cons |   3.694868   2.220274     1.66   0.096    -.6631436    8.052879
------------------------------------------------------------------------------

. ivreg lwage (educ = faed mark ssoc fhigh fint fself) lexp lexp2

Instrumental variables (2SLS) regression

      Source |       SS           df       MS      Number of obs   =       839
-------------+----------------------------------   F(3, 835)       =     30.91
       Model |  14.4993938         3  4.83313128   Prob > F        =    0.0000
    Residual |  214.235328       835  .256569255   R-squared       =    0.0634
-------------+----------------------------------   Adj R-squared   =    0.0600
       Total |  228.734721       838  .272953128   Root MSE        =    .50653

------------------------------------------------------------------------------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0923021   .0130052     7.10   0.000     .0667754    .1178288
        lexp |   .0660809   .0327562     2.02   0.044     .0017867    .1303751
       lexp2 |  -.0007302   .0007398    -0.99   0.324    -.0021823    .0007218
       _cons |   1.082091   .3990309     2.71   0.007     .2988692    1.865312
------------------------------------------------------------------------------
Instrumented:  educ
Instruments:   lexp lexp2 faed mark ssoc fhigh fint fself
------------------------------------------------------------------------------

. predict resid, residuals

. regress resid faed mark ssoc fhigh fint fself lexp lexp2

      Source |       SS           df       MS      Number of obs   =       839
-------------+----------------------------------   F(8, 830)       =      1.55
       Model |  3.14447701         8  .393059626   Prob > F        =    0.1376
    Residual |  211.090851       830  .254326326   R-squared       =    0.0147
-------------+----------------------------------   Adj R-squared   =    0.0052
       Total |  214.235328       838  .255650749   Root MSE        =    .50431

------------------------------------------------------------------------------
       resid |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        faed |   .0311568   .0280494     1.11   0.267    -.0238993     .086213
        mark |   -.007264   .0133372    -0.54   0.586    -.0334426    .0189146
        ssoc |   .0663676   .0614343     1.08   0.280    -.0542172    .1869524
       fhigh |  -.1982465   .1054761    -1.88   0.061    -.4052778    .0087848
        fint |   .0648422   .0688606     0.94   0.347    -.0703192    .2000036
       fself |  -.0885167   .0411547    -2.15   0.032    -.1692962   -.0077372
        lexp |   .0025705   .0336537     0.08   0.939    -.0634859    .0686269
       lexp2 |  -.0001366   .0007302    -0.19   0.852    -.0015698    .0012967
       _cons |    .016022   .3994509     0.04   0.968    -.7680308    .8000749
------------------------------------------------------------------------------

. regress resid faed mark ssoc fhigh fint fself

      Source |       SS           df       MS      Number of obs   =       839
-------------+----------------------------------   F(6, 832)       =      1.96
       Model |  2.98915335         6  .498192225   Prob > F        =    0.0686
    Residual |  211.246174       832  .253901652   R-squared       =    0.0140
-------------+----------------------------------   Adj R-squared   =    0.0068
       Total |  214.235328       838  .255650749   Root MSE        =    .50389

------------------------------------------------------------------------------
       resid |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        faed |   .0352761   .0274102     1.29   0.198    -.0185253    .0890774
        mark |  -.0049354   .0129782    -0.38   0.704    -.0304092    .0205384
        ssoc |   .0605415   .0607367     1.00   0.319    -.0586737    .1797566
       fhigh |  -.1814131   .1022671    -1.77   0.076     -.382145    .0193188
        fint |   .0720475   .0678139     1.06   0.288    -.0610588    .2051539
       fself |  -.0786176   .0390045    -2.02   0.044    -.1551764   -.0020587
       _cons |  -.0361857   .0919003    -0.39   0.694    -.2165693    .1441979
------------------------------------------------------------------------------

. display ((0.0147-0.0140)/2)/((1-0.0147)/(839-8-1))
.29483406

