-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/juangesino/Documents/UvA/Year 2/Semester 1/Period 2/Econometrics/CS/C
> E3/ce3.log
  log type:  text
 opened on:  21 Feb 2019, 06:33:48

. use mrw

. gen ly = ln(y85)-ln(y60)
(16 missing values generated)

. gen ly60 = ln(y60)
(5 missing values generated)

. gen linv = ln(inv/100)

. gen lpop = ln(pop/100+0.05)
(14 missing values generated)

. reg ly ly60 linv lpop

      Source |       SS           df       MS      Number of obs   =       105
-------------+----------------------------------   F(3, 101)       =     27.51
       Model |  10.5969308         3  3.53231025   Prob > F        =    0.0000
    Residual |  12.9690485       101   .12840642   R-squared       =    0.4497
-------------+----------------------------------   Adj R-squared   =    0.4333
       Total |  23.5659792       104  .226595954   Root MSE        =    .35834

------------------------------------------------------------------------------
          ly |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ly60 |  -.1829643   .0416374    -4.39   0.000    -.2655617   -.1003669
        linv |   .6932229   .0836819     8.28   0.000     .5272206    .8592252
        lpop |  -.4247699   .2651717    -1.60   0.112    -.9507992    .1012593
       _cons |   2.014286    .836947     2.41   0.018     .3540086    3.674564
------------------------------------------------------------------------------

. reg ly ly60 linv lpop, robust

Linear regression                               Number of obs     =        105
                                                F(3, 101)         =      27.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4497
                                                Root MSE          =     .35834

------------------------------------------------------------------------------
             |               Robust
          ly |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ly60 |  -.1829643   .0421434    -4.34   0.000    -.2665655   -.0993631
        linv |   .6932229   .0995059     6.97   0.000       .49583    .8906158
        lpop |  -.4247699   .2271231    -1.87   0.064     -.875321    .0257812
       _cons |   2.014286   .8270706     2.44   0.017     .3736007    3.654972
------------------------------------------------------------------------------

. reg ly ly60

      Source |       SS           df       MS      Number of obs   =       105
-------------+----------------------------------   F(1, 103)       =      0.00
       Model |  .001108967         1  .001108967   Prob > F        =    0.9446
    Residual |  23.5648702       103  .228785148   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =   -0.0097
       Total |  23.5659792       104  .226595954   Root MSE        =    .47831

------------------------------------------------------------------------------
          ly |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ly60 |   .0033592   .0482496     0.07   0.945    -.0923325     .099051
       _cons |   .4232767   .3711243     1.14   0.257    -.3127609    1.159314
------------------------------------------------------------------------------

. display ((0.4497-0.0000)/2)/((1-0.4497)*(105-3-1))
.0040455

. reg ly ly60 linv lpop

      Source |       SS           df       MS      Number of obs   =       105
-------------+----------------------------------   F(3, 101)       =     27.51
       Model |  10.5969308         3  3.53231025   Prob > F        =    0.0000
    Residual |  12.9690485       101   .12840642   R-squared       =    0.4497
-------------+----------------------------------   Adj R-squared   =    0.4333
       Total |  23.5659792       104  .226595954   Root MSE        =    .35834

------------------------------------------------------------------------------
          ly |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ly60 |  -.1829643   .0416374    -4.39   0.000    -.2655617   -.1003669
        linv |   .6932229   .0836819     8.28   0.000     .5272206    .8592252
        lpop |  -.4247699   .2651717    -1.60   0.112    -.9507992    .1012593
       _cons |   2.014286    .836947     2.41   0.018     .3540086    3.674564
------------------------------------------------------------------------------

. test (linv=0) (lpop=0)

 ( 1)  linv = 0
 ( 2)  lpop = 0

       F(  2,   101) =   41.26
            Prob > F =    0.0000

. set seed 7845

. gen u=0.35*rnormal()

. gen lys=2-0.2*ly60+0.7*linv-0.4*lpop+u
(16 missing values generated)

. reg lys ly60 linv lpop

      Source |       SS           df       MS      Number of obs   =       105
-------------+----------------------------------   F(3, 101)       =     25.06
       Model |  9.16441113         3  3.05480371   Prob > F        =    0.0000
    Residual |  12.3127184       101  .121908103   R-squared       =    0.4267
-------------+----------------------------------   Adj R-squared   =    0.4097
       Total |  21.4771295       104  .206510861   Root MSE        =    .34915

------------------------------------------------------------------------------
         lys |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ly60 |  -.2191015   .0405701    -5.40   0.000    -.2995817   -.1386213
        linv |   .6714527   .0815369     8.23   0.000     .5097053       .8332
        lpop |  -.0764167   .2583747    -0.30   0.768    -.5889627    .4361293
       _cons |   2.880386   .8154942     3.53   0.001     1.262665    4.498107
------------------------------------------------------------------------------

. display (-0.2226647)-(-0.1829643)
-.0397004

. display (0.7087286)-(0.6932229)
.0155057

. display (-0.1641832)-(-0.4247699)
.2605867

. reg lys ly60 linv lpop

      Source |       SS           df       MS      Number of obs   =       105
-------------+----------------------------------   F(3, 101)       =     25.06
       Model |  9.16441113         3  3.05480371   Prob > F        =    0.0000
    Residual |  12.3127184       101  .121908103   R-squared       =    0.4267
-------------+----------------------------------   Adj R-squared   =    0.4097
       Total |  21.4771295       104  .206510861   Root MSE        =    .34915

------------------------------------------------------------------------------
         lys |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ly60 |  -.2191015   .0405701    -5.40   0.000    -.2995817   -.1386213
        linv |   .6714527   .0815369     8.23   0.000     .5097053       .8332
        lpop |  -.0764167   .2583747    -0.30   0.768    -.5889627    .4361293
       _cons |   2.880386   .8154942     3.53   0.001     1.262665    4.498107
------------------------------------------------------------------------------

. test (linv=0) (lpop=0)

 ( 1)  linv = 0
 ( 2)  lpop = 0

       F(  2,   101) =   36.71
            Prob > F =    0.0000

. drop u lys

. gen u=3.5*rnormal()

. gen lys=2-0.2*ly60+0.7*linv-0.4*lpop+u
(16 missing values generated)

. reg lys ly60 linv lpop

      Source |       SS           df       MS      Number of obs   =       105
-------------+----------------------------------   F(3, 101)       =      0.93
       Model |    34.71758         3  11.5725267   Prob > F        =    0.4298
    Residual |  1258.49712       101  12.4603675   R-squared       =    0.0268
-------------+----------------------------------   Adj R-squared   =   -0.0021
       Total |   1293.2147       104  12.4347567   Root MSE        =    3.5299

------------------------------------------------------------------------------
         lys |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ly60 |  -.5679359   .4101621    -1.38   0.169    -1.381587    .2457154
        linv |   1.197722   .8243344     1.45   0.149     -.437536    2.832979
        lpop |   .0266049   2.612156     0.01   0.992    -5.155211     5.20842
       _cons |     6.7421   8.244608     0.82   0.415    -9.612986    23.09718
------------------------------------------------------------------------------

. test (linv=0) (lpop=0)

 ( 1)  linv = 0
 ( 2)  lpop = 0

       F(  2,   101) =    1.12
            Prob > F =    0.3309

. drop u lys

. gen u=0.35*rnormal()

. gen lys=2-0.2*ly60+0.7*linv-0.4*lpop+u
(16 missing values generated)

. reg lys ly60

      Source |       SS           df       MS      Number of obs   =       105
-------------+----------------------------------   F(1, 103)       =      0.18
       Model |  .040951584         1  .040951584   Prob > F        =    0.6721
    Residual |   23.410577       103  .227287156   R-squared       =    0.0017
-------------+----------------------------------   Adj R-squared   =   -0.0079
       Total |  23.4515286       104  .225495468   Root MSE        =    .47675

------------------------------------------------------------------------------
         lys |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ly60 |  -.0204134   .0480914    -0.42   0.672    -.1157913    .0749646
       _cons |   .4152191   .3699073     1.12   0.264    -.3184048    1.148843
------------------------------------------------------------------------------

. test (ly60=-0.2)

 ( 1)  ly60 = -.2

       F(  1,   103) =   13.94
            Prob > F =    0.0003

. drop lys

. gen lys=2-0.2*ly60+0.55*linv-0.55*lpop+u
(16 missing values generated)

. gen ip=linv-lpop
(14 missing values generated)

. regress lys ly60 ip lpop

      Source |       SS           df       MS      Number of obs   =       105
-------------+----------------------------------   F(3, 101)       =     28.85
       Model |  9.44854126         3  3.14951375   Prob > F        =    0.0000
    Residual |   11.025211       101  .109160505   R-squared       =    0.4615
-------------+----------------------------------   Adj R-squared   =    0.4455
       Total |  20.4737523       104  .196863003   Root MSE        =    .33039

------------------------------------------------------------------------------
         lys |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ly60 |  -.2165375   .0383904    -5.64   0.000    -.2926937   -.1403812
          ip |   .5459509   .0771562     7.08   0.000     .3928938    .6990081
        lpop |  -.4116469     .27368    -1.50   0.136    -.9545543    .1312606
       _cons |   1.078792   .7716802     1.40   0.165    -.4520142    2.609598
------------------------------------------------------------------------------

. regress lys ly60 ip

      Source |       SS           df       MS      Number of obs   =       105
-------------+----------------------------------   F(2, 102)       =     41.63
       Model |  9.20157985         2  4.60078992   Prob > F        =    0.0000
    Residual |  11.2721724       102  .110511495   R-squared       =    0.4494
-------------+----------------------------------   Adj R-squared   =    0.4386
       Total |  20.4737523       104  .196863003   Root MSE        =    .33243

------------------------------------------------------------------------------
         lys |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        ly60 |  -.2228456   .0383961    -5.80   0.000    -.2990041   -.1466872
          ip |   .6038694   .0672729     8.98   0.000     .4704338    .7373049
       _cons |   2.165166   .2733768     7.92   0.000     1.622924    2.707407
------------------------------------------------------------------------------

