-----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/juangesino/Documents/UvA/Year 2/Semester 1/Period 2/Econometrics/CS/C
> E4/ce4.log
  log type:  text
 opened on:  21 Feb 2019, 06:34:53

. use CE4.dta

. gen ly = log(y)

. gen ll = log(l)

. gen lk = log(k)

. sum *

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
           y |        520     7347.39    21581.02         12     350731
           l |        520    101.0673    203.3117          1       3000
           k |        520    7989.713    27670.08         10     500000
          ly |        520     7.42218    1.734664   2.484907   12.76777
          ll |        520    3.690392    1.352244          0   8.006368
-------------+---------------------------------------------------------
          lk |        520    7.232243    1.992894   2.302585   13.12236

. correlate *
(obs=520)

             |        y        l        k       ly       ll       lk
-------------+------------------------------------------------------
           y |   1.0000
           l |   0.6052   1.0000
           k |   0.8595   0.3886   1.0000
          ly |   0.5565   0.5908   0.4282   1.0000
          ll |   0.4780   0.6691   0.3726   0.8780   1.0000
          lk |   0.4502   0.4755   0.4751   0.7445   0.7159   1.0000


. hist y
(bin=22, start=12, width=15941.773)

. hist ly
(bin=22, start=2.4849066, width=.4674031)

. reg ly ll lk

      Source |       SS           df       MS      Number of obs   =       520
-------------+----------------------------------   F(2, 517)       =   1023.63
       Model |  1246.83455         2  623.417275   Prob > F        =    0.0000
    Residual |  314.867072       517  .609027218   R-squared       =    0.7984
-------------+----------------------------------   Adj R-squared   =    0.7976
       Total |  1561.70162       519    3.009059   Root MSE        =     .7804

------------------------------------------------------------------------------
          ly |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ll |   .9078204   .0362818    25.02   0.000     .8365425    .9790983
          lk |   .2070262   .0246184     8.41   0.000     .1586618    .2553906
       _cons |   2.574703      .1291    19.94   0.000     2.321078    2.828328
------------------------------------------------------------------------------

. reg ly ll

      Source |       SS           df       MS      Number of obs   =       520
-------------+----------------------------------   F(1, 518)       =   1742.07
       Model |  1203.76527         1  1203.76527   Prob > F        =    0.0000
    Residual |  357.936348       518   .69099681   R-squared       =    0.7708
-------------+----------------------------------   Adj R-squared   =    0.7704
       Total |  1561.70162       519    3.009059   Root MSE        =    .83126

------------------------------------------------------------------------------
          ly |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ll |   1.126243   .0269836    41.74   0.000     1.073233    1.179254
       _cons |   3.265901   .1060425    30.80   0.000     3.057575    3.474227
------------------------------------------------------------------------------

. reg ly lk

      Source |       SS           df       MS      Number of obs   =       520
-------------+----------------------------------   F(1, 518)       =    644.03
       Model |  865.541685         1  865.541685   Prob > F        =    0.0000
    Residual |  696.159937       518   1.3439381   R-squared       =    0.5542
-------------+----------------------------------   Adj R-squared   =    0.5534
       Total |  1561.70162       519    3.009059   Root MSE        =    1.1593

------------------------------------------------------------------------------
          ly |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          lk |   .6480018   .0255342    25.38   0.000     .5978385     .698165
       _cons |   2.735673   .1915392    14.28   0.000     2.359384    3.111963
------------------------------------------------------------------------------

. gen lys = log(1000*y)

. gen lks = log(1000*k)

. reg lys ll lks

      Source |       SS           df       MS      Number of obs   =       520
-------------+----------------------------------   F(2, 517)       =   1023.63
       Model |  1246.83455         2  623.417275   Prob > F        =    0.0000
    Residual |  314.867072       517  .609027218   R-squared       =    0.7984
-------------+----------------------------------   Adj R-squared   =    0.7976
       Total |  1561.70162       519    3.009059   Root MSE        =     .7804

------------------------------------------------------------------------------
         lys |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ll |   .9078204   .0362818    25.02   0.000     .8365425    .9790983
         lks |   .2070262   .0246184     8.41   0.000     .1586618    .2553906
       _cons |   8.052372   .2711859    29.69   0.000      7.51961    8.585134
------------------------------------------------------------------------------

. reg ly ll lk

      Source |       SS           df       MS      Number of obs   =       520
-------------+----------------------------------   F(2, 517)       =   1023.63
       Model |  1246.83455         2  623.417275   Prob > F        =    0.0000
    Residual |  314.867072       517  .609027218   R-squared       =    0.7984
-------------+----------------------------------   Adj R-squared   =    0.7976
       Total |  1561.70162       519    3.009059   Root MSE        =     .7804

------------------------------------------------------------------------------
          ly |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ll |   .9078204   .0362818    25.02   0.000     .8365425    .9790983
          lk |   .2070262   .0246184     8.41   0.000     .1586618    .2553906
       _cons |   2.574703      .1291    19.94   0.000     2.321078    2.828328
------------------------------------------------------------------------------

. test ll+lk=1

 ( 1)  ll + lk = 1

       F(  1,   517) =   20.49
            Prob > F =    0.0000

. reg ly ll lk, robust

Linear regression                               Number of obs     =        520
                                                F(2, 517)         =     951.27
                                                Prob > F          =     0.0000
                                                R-squared         =     0.7984
                                                Root MSE          =      .7804

------------------------------------------------------------------------------
             |               Robust
          ly |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ll |   .9078204   .0402712    22.54   0.000     .8287049    .9869358
          lk |   .2070262   .0304127     6.81   0.000     .1472785    .2667738
       _cons |   2.574703   .1480444    17.39   0.000      2.28386    2.865545
------------------------------------------------------------------------------

. test ll+lk=1

 ( 1)  ll + lk = 1

       F(  1,   517) =   19.60
            Prob > F =    0.0000

. gen lyd = ly-ll

. gen lkd = lk-ll

. reg lyd ll lkd

      Source |       SS           df       MS      Number of obs   =       520
-------------+----------------------------------   F(2, 517)       =     47.78
       Model |  58.1942092         2  29.0971046   Prob > F        =    0.0000
    Residual |  314.867072       517  .609027218   R-squared       =    0.1560
-------------+----------------------------------   Adj R-squared   =    0.1527
       Total |  373.061281       519  .718807863   Root MSE        =     .7804

------------------------------------------------------------------------------
         lyd |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          ll |   .1148465   .0253688     4.53   0.000     .0650079    .1646852
         lkd |   .2070262   .0246184     8.41   0.000     .1586618    .2553906
       _cons |   2.574703      .1291    19.94   0.000     2.321078    2.828328
------------------------------------------------------------------------------

